In [237]:
#importing necessary libraries
import pandas as pd
import datetime
from datetime import datetime
from time import strptime

In [238]:
# Reading the csv file using pandas by changing the column names: 
a = pd.read_csv('combined_HealthyRide_rentals.csv',header = 0, parse_dates = True,names = ["trip_id","start_time","stop_time","bike_id","trip_duration","from_station_id","from_station_name","to_station_id","to_station_name","user_type  "])

In [239]:
#analyzing few rows of the entire "Rentals" data frame
a.tail(1)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type
285455,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [240]:
#making a copy of the original dataframe
b = a.copy()

In [241]:
#to know the data types
b.dtypes

trip_id              object
start_time           object
stop_time            object
bike_id              object
trip_duration        object
from_station_id      object
from_station_name    object
to_station_id        object
to_station_name      object
user_type            object
dtype: object

In [242]:
# Since the datatypes were all in object format, analyzed the Rentals dataframe to check for inconsistencies
b["from_station_id"].value_counts()

1045               14425
1000               14343
1001               13852
1010               12089
1017               11416
1012               10973
1013               10274
1049                9179
1048                7107
1016                7086
1041                7037
1004                6084
1036                6056
1019                6028
1038                5805
1033                5779
1047                5642
1015                5584
1011                5385
1037                5290
1009                5100
1006                5060
1002                5024
1003                5007
1046                4716
1034                4164
1032                4112
1035                4005
1020                3933
1005                3902
                   ...
1063                  33
49261                 31
49741                 30
49921                 29
1067                  26
1062                  25
49621                 25
1761                  23
49301                 22
49881                 19
49781                 18
49441                 18
1762                  17
1751                  16
49351                 15
1091                  14
49491                 14
From station id       14
1052                  10
1069                  10
49461                  9
49371                  7
49251                  6
1071                   4
1781                   3
1097                   2
49341                  2
1072                   1
1053                   1
1764                   1
Name: from_station_id, Length: 116, dtype: int64

In [243]:
#drop the non-integer data
b = b[b["from_station_id"].apply(lambda x: str(x).isdigit())]
b["from_station_id"].value_counts()

1045     14425
1000     14343
1001     13852
1010     12089
1017     11416
1012     10973
1013     10274
1049      9179
1048      7107
1016      7086
1041      7037
1004      6084
1036      6056
1019      6028
1038      5805
1033      5779
1047      5642
1015      5584
1011      5385
1037      5290
1009      5100
1006      5060
1002      5024
1003      5007
1046      4716
1034      4164
1032      4112
1035      4005
1020      3933
1005      3902
         ...
1093        34
1063        33
49261       31
49741       30
49921       29
1067        26
49621       25
1062        25
1761        23
49301       22
49881       19
49441       18
49781       18
1762        17
1751        16
49351       15
49491       14
1091        14
1052        10
1069        10
49461        9
49371        7
49251        6
1071         4
1781         3
1097         2
49341        2
1764         1
1072         1
1053         1
Name: from_station_id, Length: 115, dtype: int64

In [244]:
b["from_station_id"] = b["from_station_id"].astype(int)

In [245]:
b.dtypes

trip_id              object
start_time           object
stop_time            object
bike_id              object
trip_duration        object
from_station_id       int32
from_station_name    object
to_station_id        object
to_station_name      object
user_type            object
dtype: object

In [246]:
b.shape

(280710, 10)

In [247]:
b = b.dropna()

In [248]:
b.shape

(276458, 10)

In [249]:
b.tail(2)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type
285453,63848091,12/30/18 10:17 PM,12/30/18 10:24 PM,70150,402,1012,North Shore Trail & Fort Duquesne Bridge,1001,Forbes Ave & Market Square,Subscriber
285454,63848092,12/30/18 10:17 PM,12/31/18 12:07 PM,70229,49800,1012,North Shore Trail & Fort Duquesne Bridge,1001,Forbes Ave & Market Square,Customer

In [250]:
#converting datatypes
b["to_station_id"] = b["to_station_id"].astype(int)
b["trip_duration"] = b["trip_duration"].astype(int)
b["bike_id"] = b["bike_id"].astype(int)
b['start_time'] =  pd.to_datetime(b['start_time'], format = '%m/%d/%y %I:%M %p')
b['stop_time'] =  pd.to_datetime(b['stop_time'], format = '%m/%d/%y %I:%M %p')

In [251]:
b.head(1)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type
0,25723960,2017-01-01 08:28:00,2017-01-01 08:30:00,70478,110,1043,S Millvale Ave & Centre Ave,1044,Zulema St & Coltart Ave,Subscriber

In [252]:
b.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 276458 entries, 0 to 285454
Data columns (total 10 columns):
trip_id              276458 non-null object
start_time           276458 non-null datetime64[ns]
stop_time            276458 non-null datetime64[ns]
bike_id              276458 non-null int32
trip_duration        276458 non-null int32
from_station_id      276458 non-null int32
from_station_name    276458 non-null object
to_station_id        276458 non-null int32
to_station_name      276458 non-null object
user_type            276458 non-null object
dtypes: datetime64[ns](2), int32(4), object(4)
memory usage: 19.0+ MB

In [253]:
#reading the csv file and renaming the column names  as from_latitudes & from_longitudes to merge with "Rentals" dataframe
c = pd.read_csv('C:/Users/srao/PBSDP/pbs.csv', header = 0,names = ["from_station_id","StationName","RackQnty","from_latitude","from_longitude"])

In [254]:
#Copying dataframes 
d = c.copy()

In [255]:
d.head(1)

  from_station_id        StationName  RackQnty  from_latitude  from_longitude
0            1000  Liberty & Stanwix      16.0      40.441326      -80.004679

In [256]:
#dropping the unwanted columns
d.drop(["StationName",'RackQnty'],inplace = True,axis = 1)
#dropping the unwanted columnse["StationName",'RackQnty']
d.head(1)

  from_station_id  from_latitude  from_longitude
0            1000      40.441326      -80.004679

In [257]:
b.head(2)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type
0,25723960,2017-01-01 08:28:00,2017-01-01 08:30:00,70478,110,1043,S Millvale Ave & Centre Ave,1044,Zulema St & Coltart Ave,Subscriber
1,25724207,2017-01-01 09:53:00,2017-01-01 10:00:00,70439,426,1014,Ridge Ave & Brighton Rd (CCAC),1012,North Shore Trail & Fort Duquesne Bridge,Customer

In [258]:
b.sort_values(['start_time'], inplace = True)

In [259]:
b.head(4)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type
136321,10676972,2015-05-31 06:54:00,2015-05-31 10:17:00,70166,12190,1018,Butler St & Stanton Ave,1001,Forbes Ave & Market Square,Customer
136322,10677086,2015-05-31 06:57:00,2015-05-31 09:24:00,70368,8842,1018,Butler St & Stanton Ave,1018,Butler St & Stanton Ave,Subscriber
136323,10677131,2015-05-31 06:58:00,2015-05-31 10:09:00,70354,11448,1019,42nd St & Butler St,1019,42nd St & Butler St,Subscriber
136324,10677525,2015-05-31 07:08:00,2015-05-31 07:15:00,70232,452,1001,Forbes Ave & Market Square,1001,Forbes Ave & Market Square,Subscriber

In [260]:
b.shape

(276458, 10)

In [261]:
d.dtypes

from_station_id     object
from_latitude      float64
from_longitude     float64
dtype: object

In [262]:
d = d[d["from_station_id"].apply(lambda x: str(x).isdigit())]
d["from_station_id"].value_counts()

1027    12
1044    12
1011    12
1028    12
1029    12
1023    12
1024    12
1009    12
1005    12
1033    12
1015    12
1014    12
1001    12
1006    12
1018    12
1007    12
1008    12
1035    12
1041    12
1025    12
1038    12
1002    12
1000    12
1022    12
1030    12
1037    12
1046    12
1043    12
1010    12
1026    12
1048    12
1020    12
1004    12
1034    12
1016    12
1032    12
1031    12
1003    12
1047    12
1017    12
1021    12
1039    12
1049    12
1045    12
1036    12
1042    12
1040    12
1012    12
1019    12
1013    12
1061     5
1050     5
Name: from_station_id, dtype: int64

In [263]:
c.shape

(611, 5)

In [264]:
d.shape

(610, 3)

In [265]:
d["from_station_id"] = d["from_station_id"].astype(int)

In [266]:
d.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 610 entries, 0 to 609
Data columns (total 3 columns):
from_station_id    610 non-null int32
from_latitude      610 non-null float64
from_longitude     610 non-null float64
dtypes: float64(2), int32(1)
memory usage: 16.7 KB

In [267]:
d =d.drop_duplicates()

In [268]:
df.shape

(272353, 12)

In [269]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 272353 entries, 0 to 377772
Data columns (total 12 columns):
trip_id              272353 non-null object
start_time           272353 non-null datetime64[ns]
stop_time            272353 non-null datetime64[ns]
bike_id              272353 non-null int32
trip_duration        272353 non-null int32
to_station_id        272353 non-null int32
from_station_name    272353 non-null object
to_station_id        272353 non-null int32
to_station_name      272353 non-null object
user_type            272353 non-null object
to_latitude          272353 non-null float64
to_longitude         272353 non-null float64
dtypes: datetime64[ns](2), float64(2), int32(4), object(4)
memory usage: 22.9+ MB

In [270]:
d.shape

(70, 3)

In [271]:
df = pd.merge(b,d, on =["from_station_id"])

In [272]:
df.shape

(377773, 12)

In [273]:
#(276458, 10)
d.shape

(70, 3)

In [274]:
df = df.drop_duplicates()

In [275]:
df.shape

(377773, 12)

In [277]:
#Note: Beginning in Q2 2018, we are now reporting “dockless” trips where a bike does not start or end at an 
#official station.For these trips, the start or end station name will be the bike number.

df.head(1)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type,from_latitude,from_longitude
0,10676972,2015-05-31 06:54:00,2015-05-31 10:17:00,70166,12190,1018,Butler St & Stanton Ave,1001,Forbes Ave & Market Square,Customer,40.466103,-79.964628

In [278]:
df["trip_id"].value_counts()

49095741    3
23046729    3
39775611    3
31472561    3
21145419    3
11344053    3
40704566    3
11821611    3
36328871    3
34034370    3
19685628    3
14347702    3
54122995    3
25268364    3
28275129    3
24324561    3
13993166    3
60844970    3
52247229    3
63490646    3
32254168    3
28014200    3
11752249    3
13433348    3
14928751    3
19531074    3
50993066    3
12394286    3
24404198    3
14119545    3
           ..
39102352    1
15691977    1
16966693    1
42205495    1
20792405    1
15452375    1
12098542    1
12848703    1
25757028    1
41221054    1
14595375    1
36597690    1
12810970    1
45932670    1
22641348    1
38694456    1
36554808    1
12325337    1
19271645    1
25991178    1
41410303    1
62329382    1
54271261    1
13567665    1
12495010    1
14851030    1
14330287    1
60818290    1
29169807    1
23331527    1
Name: trip_id, Length: 272353, dtype: int64

In [279]:
df[df["trip_id"]=="49095741"]

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type,from_latitude,from_longitude
356580,49095741,2018-06-02 18:32:00,2018-06-02 18:45:00,70086,824,1040,O'Hara St and University Place (Soldiers and S...,1029,Alder St & S Highland Ave,Subscriber,40.444628,-79.955016
356581,49095741,2018-06-02 18:32:00,2018-06-02 18:45:00,70086,824,1040,O'Hara St and University Place (Soldiers and S...,1029,Alder St & S Highland Ave,Subscriber,40.444708,-79.955025
356582,49095741,2018-06-02 18:32:00,2018-06-02 18:45:00,70086,824,1040,O'Hara St and University Place (Soldiers and S...,1029,Alder St & S Highland Ave,Subscriber,40.445128,-79.957102

In [280]:
df = df.drop_duplicates(subset=['trip_id'], keep='first')

In [281]:
df.shape

(272353, 12)

In [282]:
e = c.copy()

In [283]:
e.head(1)

  from_station_id        StationName  RackQnty  from_latitude  from_longitude
0            1000  Liberty & Stanwix      16.0      40.441326      -80.004679

In [284]:
e.drop(["StationName",'RackQnty'],inplace = True,axis = 1)

In [285]:
e = e.drop_duplicates()

In [286]:
e =e.dropna()

In [287]:
e.shape

(70, 3)

In [288]:
e.tail(1)

    from_station_id  from_latitude  from_longitude
401            1061      40.462026      -79.968114

In [289]:
e.rename(columns={'from_station_id': 'to_station_id', "from_latitude":"to_latitude",'from_longitude': 'to_longitude'}, inplace=True)

In [290]:
e.head(1)

  to_station_id  to_latitude  to_longitude
0          1000    40.441326    -80.004679

In [291]:
e["to_station_id"] = e["to_station_id"].astype(int)

In [292]:
e.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70 entries, 0 to 401
Data columns (total 3 columns):
to_station_id    70 non-null int32
to_latitude      70 non-null float64
to_longitude     70 non-null float64
dtypes: float64(2), int32(1)
memory usage: 1.9 KB

In [293]:
df.head(1)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type,from_latitude,from_longitude
0,10676972,2015-05-31 06:54:00,2015-05-31 10:17:00,70166,12190,1018,Butler St & Stanton Ave,1001,Forbes Ave & Market Square,Customer,40.466103,-79.964628

In [294]:
df1 = df.copy()

In [295]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 272353 entries, 0 to 377772
Data columns (total 12 columns):
trip_id              272353 non-null object
start_time           272353 non-null datetime64[ns]
stop_time            272353 non-null datetime64[ns]
bike_id              272353 non-null int32
trip_duration        272353 non-null int32
from_station_id      272353 non-null int32
from_station_name    272353 non-null object
to_station_id        272353 non-null int32
to_station_name      272353 non-null object
user_type            272353 non-null object
from_latitude        272353 non-null float64
from_longitude       272353 non-null float64
dtypes: datetime64[ns](2), float64(2), int32(4), object(4)
memory usage: 22.9+ MB

In [297]:
df1["to_station_id"].value_counts()

1045     16497
1000     16388
1001     15845
1017     12033
1010     11952
1012     11922
1013     10603
1049      9661
1048      8124
1019      7982
1016      7586
1041      6263
1036      5869
1004      5662
1047      5545
1015      5290
1011      5256
1033      5242
1037      5057
1003      4928
1038      4902
1046      4569
1002      4461
1006      4303
1018      4157
1009      4080
1028      3889
1034      3664
1029      3441
1005      3436
         ...
1056        21
49731       19
1771        18
1070        15
49781       15
1094        14
49741       11
49621        9
1063         9
1762         8
1062         8
49881        8
49261        7
49301        6
1067         6
1064         5
49491        5
1066         5
49371        5
1781         5
1069         3
49441        3
1091         3
1072         3
1071         2
49351        2
49461        2
1761         2
49251        2
1751         1
Name: to_station_id, Length: 108, dtype: int64

In [298]:
df2 = pd.merge(df1,e, on = ['to_station_id'])

In [299]:
df2.head(1)

,trip_id,start_time,stop_time,bike_id,trip_duration,from_station_id,from_station_name,to_station_id,to_station_name,user_type,from_latitude,from_longitude,to_latitude,to_longitude
0,10676972,2015-05-31 06:54:00,2015-05-31 10:17:00,70166,12190,1018,Butler St & Stanton Ave,1001,Forbes Ave & Market Square,Customer,40.466103,-79.964628,40.440877,-80.00308

In [300]:
df2["trip_id"].value_counts()

20464428    3
13405647    3
24792292    3
12228202    3
19407819    3
12478669    3
43671683    3
15250680    3
11929167    3
25565863    3
22814466    3
18053039    3
15889834    3
60254331    3
13352145    3
15453142    3
19354381    3
12830321    3
13568865    3
15289562    3
52816293    3
25696438    3
14560306    3
18221343    3
12988948    3
59809414    3
24529770    3
13757172    3
14928321    3
52906155    3
           ..
30728686    1
14607826    1
35759965    1
15359087    1
11482652    1
52136602    1
39763847    1
17123146    1
15876882    1
34510354    1
41657223    1
24322755    1
45913453    1
13148066    1
25440524    1
36429096    1
11062365    1
55019213    1
24935323    1
13647519    1
37491016    1
12943975    1
33775114    1
59645865    1
10930690    1
56943399    1
52502033    1
13060878    1
56836451    1
23331527    1
Name: trip_id, Length: 269687, dtype: int64

In [301]:
df2 = df2.drop_duplicates(subset=['trip_id'], keep='first')

In [302]:
df2.shape

(269687, 14)

In [303]:
df3 = df2.copy()

In [304]:
c = df2.to_csv("Pittsburgh_dataset_lon_lat.csv",index = False)